app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'kshirsagarpravin.1111@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $validation = $this->validate([
            'name' => 'required',
            'email' => 'required|valid_email',
            'password' => 'required',
        ]);

        if (!$validation) {
            return redirect()->to('auth')->withInput()->with('validation', $this->validator);
        } else {

            $name = $this->request->getPost('name');
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $usersModel = new UsersModel();

            $existingEmail = $usersModel->where('email', $email)->first();

SELECT *
FROM `users`
WHERE `email` = '12@gmail.com'
 LIMIT 1
---
    public function check()
    {
        $validation = $this->validate([
            'email' => 'required|valid_email',
            'password' => 'required',
        ]);

        if (!$validation) {
            return redirect()->to('auth')->withInput()->with('validation', $this->validator);
        } else {

            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $usersModel = new UsersModel();
            $user = $usersModel->where('email', $email)->first();