app/Controllers/Dashboard.php

    public function index(): string
    {
        $userModel = new \App\Models\UsersModel();
        $userInfo = $userModel->findAll();
---
SELECT *
FROM `users`

    function profile()
    {
        $userModel = new \App\Models\UsersModel();
        $loggedUserId = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '29'